In [1]:
import pandas as pd
# import numpy as np
import csv
# import matplotlib.pyplot as plt
# import seaborn as sns
# sns.set()
from sqlalchemy import create_engine

# from sqlalchemy.ext.declarative import declarative_base
# Base = declarative_base()
# from sqlalchemy import Column, Integer, String, Float
from sqlalchemy import create_engine
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\owner\anaconda3\lib\site-packages (2.8.4)

## Energy Data Manipulation

In [2]:
energy_data = pd.read_csv('Data/annual_generation_state.csv')
energy_data.head()

,YEAR,STATE_id,TYPE OF PRODUCER,ENERGY SOURCE,GENERATION (Megawatthours)
0,1990,AK,Total Electric Power Industry,Total,5599506
1,1990,AK,Total Electric Power Industry,Coal,510573
2,1990,AK,Total Electric Power Industry,Hydroelectric Conventional,974521
3,1990,AK,Total Electric Power Industry,Natural Gas,3466261
4,1990,AK,Total Electric Power Industry,Petroleum,497116

In [3]:
energy_data['STATE_id'].unique()

array(['AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'D.C', 'DE', 'FL', 'GA',
       'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME',
       'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM',
       'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'US-TOTAL', 'UT', 'VA', 'VT', 'WA', 'WI', 'WV', 'WY', 'DC', '  ',
       'US-Total'], dtype=object)

In [4]:
## Dropping Unwanted columns and rows
energy_data = energy_data.loc[energy_data['ENERGY SOURCE'] != 'Total']
# energy_data = energy_data.loc[energy_data['GENERATION (Megawatthours)'] != 0]
energy_data = energy_data.loc[energy_data['STATE_id'] != 'US-TOTAL']
energy_data = energy_data.loc[energy_data['STATE_id'] != 'US-Total']

energy_data.head()

,YEAR,STATE_id,TYPE OF PRODUCER,ENERGY SOURCE,GENERATION (Megawatthours)
1,1990,AK,Total Electric Power Industry,Coal,510573
2,1990,AK,Total Electric Power Industry,Hydroelectric Conventional,974521
3,1990,AK,Total Electric Power Industry,Natural Gas,3466261
4,1990,AK,Total Electric Power Industry,Petroleum,497116
5,1990,AK,Total Electric Power Industry,Wind,0

In [5]:
energy_data['ENERGY SOURCE'].unique()

array(['Coal', 'Hydroelectric Conventional', 'Natural Gas', 'Petroleum',
       'Wind', 'Wood and Wood Derived Fuels', 'Nuclear', 'Other Biomass',
       'Other Gases', 'Pumped Storage', 'Geothermal', 'Other',
       'Solar Thermal and Photovoltaic'], dtype=object)

In [6]:
## Grouping Into Conventional  & Green Energy Sources

def energy_label(row):
    if row['ENERGY SOURCE']=='Natural Gas':
        return 'Conventional'
    elif row['ENERGY SOURCE']=='Petroleum':
        return 'Conventional'
    elif row['ENERGY SOURCE']=='Coal':
        return 'Conventional'
    elif  row['ENERGY SOURCE']=='Other Biomass':
        return 'Conventional'
    elif  row['ENERGY SOURCE']=='Hydroelectric Conventional':
        return 'Green Energy'
    elif row['ENERGY SOURCE']=='Wood and Wood Derived Fuels':
        return 'Conventional'
    elif row['ENERGY SOURCE']=='Other':
        return 'N/A'
    elif row['ENERGY SOURCE']=='Wind':
        return 'Green Energy'
    elif row['ENERGY SOURCE']=='Nuclear':
        return 'Green Energy'
    elif row['ENERGY SOURCE']=='Solar Thermal and Photovoltaic':
        return 'Green Energy'
    elif row['ENERGY SOURCE']=='Pumped Storage':
        return 'Green Energy'
    elif row['ENERGY SOURCE']=='Geothermal':
        return 'Green Energy'
    else:
        return 'N/A'
    
energy_data['ENERGY TYPE'] = energy_data.apply (lambda row: energy_label(row), axis=1)
energy_data.head()


# energy_data['ENERGY TYPE'] = energy_data['ENERGY SOURCE']({'Natural Gas':'Conventional',\
#                                                            'Petroleum':'Conventional',\
#                                                            'Coal':'Conventional',\
#                                                            'Other Biomass':'Green Energy',\
#                                                            'Hydroelectric Conventional':'Green Energy',\
#                                                            'Wood and Wood Derived Fuels':'Green Energy',\
#                                                            'Other':'Conventional',\
#                                                            'Other Gases':'Conventional',\
#                                                            'Wind':'Green Energy',\
#                                                            'Nuclear':'Green Energy',\
#                                                            'Solar Thermal and Photovoltaic':'Green Energy',\
#                                                            'Pumped Storage':'Green Energy',\
#                                                            'Geothermal':'Green Energy'})

,YEAR,STATE_id,TYPE OF PRODUCER,ENERGY SOURCE,GENERATION (Megawatthours),ENERGY TYPE
1,1990,AK,Total Electric Power Industry,Coal,510573,Conventional
2,1990,AK,Total Electric Power Industry,Hydroelectric Conventional,974521,Green Energy
3,1990,AK,Total Electric Power Industry,Natural Gas,3466261,Conventional
4,1990,AK,Total Electric Power Industry,Petroleum,497116,Conventional
5,1990,AK,Total Electric Power Industry,Wind,0,Green Energy

## GroupBy for Sum (Double Bar)
Saving for post-SQL

In [7]:
# ## Summing Up Conventional & Green Energy Produced by each state per year, from 1990-2018
# ## Dropping the Type of Producer Column

# energy_produced = energy_data[['STATE_id','YEAR','ENERGY TYPE','GENERATION (Megawatthours)']]
# energy_produced = energy_produced.groupby(['YEAR','STATE_id','ENERGY TYPE']).sum()['GENERATION (Megawatthours)']

In [8]:
# energy_produced = pd.DataFrame(energy_produced)
# energy_produced['GENERATION (Megawatthours)'] = energy_produced['GENERATION (Megawatthours)'].astype(int).map("{:,}".format)
energy_data.head()

,YEAR,STATE_id,TYPE OF PRODUCER,ENERGY SOURCE,GENERATION (Megawatthours),ENERGY TYPE
1,1990,AK,Total Electric Power Industry,Coal,510573,Conventional
2,1990,AK,Total Electric Power Industry,Hydroelectric Conventional,974521,Green Energy
3,1990,AK,Total Electric Power Industry,Natural Gas,3466261,Conventional
4,1990,AK,Total Electric Power Industry,Petroleum,497116,Conventional
5,1990,AK,Total Electric Power Industry,Wind,0,Green Energy

In [9]:
energy_data.dtypes
energy_data = energy_data.rename(columns={'YEAR':'year_energy','TYPE OF PRODUCER':'Type_of_producer','ENERGY SOURCE':
                                         'energy_source','GENERATION (Megawatthours)':'generation_megewatthours',
                                         'ENERGY TYPE':'energy_type'})
energy_data.dtypes

year_energy                  int64
STATE_id                    object
Type_of_producer            object
energy_source               object
generation_megewatthours     int64
energy_type                 object
dtype: object

## Income Data Manipulation

In [10]:
income_data = pd.read_csv('Data/Median_Income_state-1990.csv')
income_data.head()

   YEAR       STATE STATE_id  Median_Income
0  1990      Alaska       AK          42607
1  1990     Arizona       AL          71686
2  1990     Arizona       AZ          53309
3  1990    Arkansas       AR          41565
4  1990  California       CA          60726

In [11]:
# income_data['Median_Income'] = income_data['Median_Income'].astype(int).map("{:,}".format)
# income_data.head()
income_data.dtypes

income_data = income_data.rename(columns={'YEAR':'year_income','STATE':'State_income'})
income_data.dtypes

year_income       int64
State_income     object
STATE_id         object
Median_Income     int64
dtype: object

## Population Data Manipulation

In [12]:
population_dirty = pd.read_csv('Data/Population_data.csv')
population_dirty.head()

   Unnamed: 0  YEAR STATE_id    STATE Population
0           0  1990       AL  Alabama  4,050,055
1           1  1991       AL  Alabama  4,099,156
2           2  1992       AL  Alabama  4,154,014
3           3  1993       AL  Alabama  4,214,202
4           4  1994       AL  Alabama  4,260,229

In [13]:
population_dirty['POPULATION'] = population_dirty['Population'].replace(',', '',regex=True)
population_dirty['POPULATION'] = population_dirty['POPULATION'].astype('int64')
population_dirty.head()

   Unnamed: 0  YEAR STATE_id    STATE Population  POPULATION
0           0  1990       AL  Alabama  4,050,055     4050055
1           1  1991       AL  Alabama  4,099,156     4099156
2           2  1992       AL  Alabama  4,154,014     4154014
3           3  1993       AL  Alabama  4,214,202     4214202
4           4  1994       AL  Alabama  4,260,229     4260229

In [14]:
population_data = population_dirty[['YEAR','STATE_id','STATE','POPULATION']]

population_data.dtypes
population_data.head()
population_data = population_data.rename(columns={'YEAR':'year_population','STATE':'state_population','POPULATION':'population'})
##population_data.dtypes

## Saves

In [15]:
 ## Saving All Updated Datasets as csv files

energy_data.to_csv('Energy_data.csv')
income_data.to_csv('Income_data.csv')
population_data.to_csv('Population_data.csv')

In [23]:
#Connect to local Database
rds_connection_string = "postgres:postgres@localhost:5432/test_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [24]:
engine.table_names()

['energy_data', 'income_data', 'population_data']

In [27]:
#Load Csv's into Database
population_data.to_sql(name='population_data', con=engine, if_exists='append', index=False)

income_data.to_sql(name='income_data', con=engine, if_exists='append', index=False)

energy_data.to_sql(name='energy_data', con=engine, if_exists='append', index=False)